# Unset Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IFCAnyHandle..::..Unset Method
IFCAnyHandle Class See Also
---
Clears the handle.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Unset()
```

Visual Basic
---
```text
Public Sub Unset
```

Visual C++
---
```text
public:
void Unset()
```

# See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace